/*
 * [Rocky 2017-12-26 11:37:52]
 * 全局错误定义
 */
export const errcode = {
    OK: 0, // 正确
    SYS_ERR: -10001, // 系统出错
    PARAM_ERR: -10002, // 参数出错
    SYS_BUSY: -10003, // 系统忙
    USER_NO_EXIST: -10005, // 用户不存在
    USER_HAD_REG: -10006, // 此用户名已被注册
    USER_PASSWD_ERR: -10007, // 登录密码出错
    DATA_PASSWD_ERR: -10008, // 密码错误

    code: {
        "0": "正确",
        "-10001": "系统出错",
        "-10002": "参数出错",
        "-10003": "系统忙",
        "-10005": "用户不存在",
        "-10006": "登录手机号已被注册",
        // "-10006": "此用户名已被注册",
        "-10007": "账号或登录密码出错",
        // "-10007": "登录密码出错",
        "-10008": "密码错误",
    },
    toString: function (code) {
        code = parseInt(code || 0);
        return this.code[code] || "未知[" + code + "]";
    }
    ///////////////////////////////////////////////////////////////////
    //
    //     无特殊要求，上定义不要改变，新加的出错码写下在，按10递增
    //
    ///////////////////////////////////////////////////////////////////

    //const xxx  = -200010       //出错描述

    /*
    * 注意同步修改 js/cfg.js --> errcode
    */
};
